#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.gke.random_string.cluster_service_account_suffix: Refreshing state... [id=bxl4]
random_id.db_user_pass: Refreshing state... [id=i0AKWf6GgIU]
random_id.suffix: Refreshing state... [id=HALUyd94qio]
random_id.airflow_webserver_secret: Refreshing state... [id=x26S6D9BwDs]
data.google_service_account_access_token.default: Reading...
data.google_service_account_access_token.default: Read complete after 0s [id=projects/-/serviceAccounts/deb-sa@wizeline-deb.iam.gserviceaccount.com]
data.google_client_config.default: Reading...
module.cloudresourcemanager_service.google_project_service.project_services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=wizeline-deb/cloudresourcemanager.googleapis.com]
module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/wizeline-deb/global/networks/deb-capstone-net]
google_artifact_registry_repository.docker_repository: Refreshing state... [id=projects/wizeline-deb/locations/us-central1/repositories/deb-capstone-airflow-gke]
data.google_service_account.deb-sa: Reading...
google_secret_manager_secret.airflow_webserver_secret: Refreshing state... [id=projects/wizeline-deb/secrets/airflow-webserver-secret]
data.google_client_config.default: Read complete after 0s [id=projects/"wizeline-deb"/regions/"us-central1"/zones/"us-central1-c"]
data.google_service_account.deb-sa: Read complete after 0s [id=projects/wizeline-deb/serviceAccounts/deb-sa@wizeline-deb.iam.gserviceaccount.com]
google_secret_manager_secret_version.airflow_webserver_secret_v1: Refreshing state... [id=projects/734911192367/secrets/airflow-webserver-secret/versions/1]
data.google_secret_manager_secret_version.airflow_webserver_secret: Reading...
google_compute_global_address.private_ip_alloc: Refreshing state... [id=projects/wizeline-deb/global/addresses/private-ip-alloc]
module.gke.data.google_container_engine_versions.region: Reading...
module.gke.google_service_account.cluster_service_account[0]: Refreshing state... [id=projects/wizeline-deb/serviceAccounts/tf-gke-deb-airflow-clu-bxl4@wizeline-deb.iam.gserviceaccount.com]
module.gke.data.google_compute_zones.available: Reading...
module.vpc.module.subnets.google_compute_subnetwork.subnetwork["us-central1/deb-sub1"]: Refreshing state... [id=projects/wizeline-deb/regions/us-central1/subnetworks/deb-sub1]
module.gke.google_project_iam_member.cluster_service_account-log_writer[0]: Refreshing state... [id=wizeline-deb/roles/logging.logWriter/serviceAccount:tf-gke-deb-airflow-clu-bxl4@wizeline-deb.iam.gserviceaccount.com]
data.google_secret_manager_secret_version.airflow_webserver_secret: Read complete after 0s [id=projects/734911192367/secrets/airflow-webserver-secret/versions/1]
module.gke.google_project_iam_member.cluster_service_account-metric_writer[0]: Refreshing state... [id=wizeline-deb/roles/monitoring.metricWriter/serviceAccount:tf-gke-deb-airflow-clu-bxl4@wizeline-deb.iam.gserviceaccount.com]
module.gke.data.google_compute_zones.available: Read complete after 0s [id=projects/wizeline-deb/regions/us-central1]
module.gke.data.google_container_engine_versions.zone: Reading...
module.gke.random_shuffle.available_zones: Refreshing state... [id=-]
google_service_networking_connection.default: Refreshing state... [id=projects%2Fwizeline-deb%2Fglobal%2Fnetworks%2Fdeb-capstone-net:servicenetworking.googleapis.com]
module.gke.data.google_container_engine_versions.region: Read complete after 0s [id=2023-09-23 15:30:06.337160927 +0000 UTC]
module.gke.google_project_iam_member.cluster_service_account-monitoring_viewer[0]: Refreshing state... [id=wizeline-deb/roles/monitoring.viewer/serviceAccount:tf-gke-deb-airflow-clu-bxl4@wizeline-deb.iam.gserviceaccount.com]
module.gke.data.google_container_engine_versions.zone: Read complete after 1s [id=2023-09-23 15:30:06.503571606 +0000 UTC]
module.gke.google_container_cluster.primary: Refreshing state... [id=projects/wizeline-deb/locations/us-central1/clusters/deb-airflow-cluster-1c02d4c9df78aa2a]
module.gke.google_project_iam_member.cluster_service_account-resourceMetadata-writer[0]: Refreshing state... [id=wizeline-deb/roles/stackdriver.resourceMetadata.writer/serviceAccount:tf-gke-deb-airflow-clu-bxl4@wizeline-deb.iam.gserviceaccount.com]
null_resource.dependency_setter: Refreshing state... [id=7501409296193744120]
module.sql-db.null_resource.module_depends_on: Refreshing state... [id=7720046657180841183]
module.sql-db.google_sql_database_instance.default: Refreshing state... [id=deb-sql-instance-1c02d4c9df78aa2a]
module.gke.google_container_node_pool.pools["deb-node-pool"]: Refreshing state... [id=projects/wizeline-deb/locations/us-central1/clusters/deb-airflow-cluster-1c02d4c9df78aa2a/nodePools/deb-node-pool]
module.sql-db.google_sql_database.default[0]: Refreshing state... [id=projects/wizeline-deb/instances/deb-sql-instance-1c02d4c9df78aa2a/databases/default]
module.sql-db.random_password.user-password: Refreshing state... [id=none]
module.sql-db.google_sql_database.additional_databases["deb-airflow-db"]: Refreshing state... [id=projects/wizeline-deb/instances/deb-sql-instance-1c02d4c9df78aa2a/databases/deb-airflow-db]
module.sql-db.google_sql_user.default[0]: Refreshing state... [id=default//deb-sql-instance-1c02d4c9df78aa2a]
kubernetes_secret.airflow_webserver_secret: Refreshing state... [id=airflow/airflow-webserver-secret]
module.services.google_project_service.project_services["iamcredentials.googleapis.com"]: Refreshing state... [id=wizeline-deb/iamcredentials.googleapis.com]
module.services.google_project_service.project_services["servicenetworking.googleapis.com"]: Refreshing state... [id=wizeline-deb/servicenetworking.googleapis.com]
module.services.google_project_service.project_services["compute.googleapis.com"]: Refreshing state... [id=wizeline-deb/compute.googleapis.com]
module.services.google_project_service.project_services["cloudbuild.googleapis.com"]: Refreshing state... [id=wizeline-deb/cloudbuild.googleapis.com]
module.services.google_project_service.project_services["container.googleapis.com"]: Refreshing state... [id=wizeline-deb/container.googleapis.com]
module.services.google_project_service.project_services["bigquery.googleapis.com"]: Refreshing state... [id=wizeline-deb/bigquery.googleapis.com]
module.services.google_project_service.project_services["sqladmin.googleapis.com"]: Refreshing state... [id=wizeline-deb/sqladmin.googleapis.com]
module.services.google_project_service.project_services["iam.googleapis.com"]: Refreshing state... [id=wizeline-deb/iam.googleapis.com]
module.services.google_project_service.project_services["artifactregistry.googleapis.com"]: Refreshing state... [id=wizeline-deb/artifactregistry.googleapis.com]
module.services.google_project_service.project_services["secretmanager.googleapis.com"]: Refreshing state... [id=wizeline-deb/secretmanager.googleapis.com]
module.services.google_project_service.project_services["dataproc.googleapis.com"]: Refreshing state... [id=wizeline-deb/dataproc.googleapis.com]
google_secret_manager_secret.db_user_pass: Refreshing state... [id=projects/wizeline-deb/secrets/db-user-pass-1c02d4c9df78aa2a]
module.services.google_project_service.project_services["storage-component.googleapis.com"]: Refreshing state... [id=wizeline-deb/storage-component.googleapis.com]
google_secret_manager_secret_version.db_user_pass: Refreshing state... [id=projects/734911192367/secrets/db-user-pass-1c02d4c9df78aa2a/versions/1]
data.google_secret_manager_secret_version.db_user_pass: Reading...
data.google_secret_manager_secret_version.db_user_pass: Read complete after 0s [id=projects/734911192367/secrets/db-user-pass-1c02d4c9df78aa2a/versions/1]
module.sql-db.random_password.additional_passwords["postgres0"]: Refreshing state... [id=none]
helm_release.airflow: Refreshing state... [id=airflow]
module.sql-db.google_sql_user.additional_users["postgres0"]: Refreshing state... [id=postgres0//deb-sql-instance-1c02d4c9df78aa2a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubernetes_secret.airflow_ssh_secret will be created
  + resource "kubernetes_secret" "airflow_ssh_secret" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "airflow-ssh-secret"
          + namespace        = "airflow"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @uche-madu, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Workflow`*